<h1> ЗАДАНИЕ 1 </h1>
<?php
$a=2;
switch($a){
    case 1:
        $b="one";
        echo $b;
        break;
    case 2:
        echo "two";
        break;
    case 3:
        echo "three";
        break;
    case 4:
        echo "four";
        break;
    case 5:
        echo "five";
        break;
    case 6:
        $b="six";
        echo $b;
        break;
    case 7:
        echo "seven";
        break;
    case 8:
        echo "eight";
        break;
    case 9:
        echo "nine";
        break;
    case 0:
        echo "zero";
        break;
        default:
        echo "ничего не совпало";
}

?>

<h1> ЗАДАНИЕ 2 </h1>

<?php
$a=9;
switch($a){
    case 1:
        $b="В Январе праздники - 
        1, 2, 3, 4, 5, 6 и 8 января — Новогодние каникулы;
7 января — Рождество Христово;
12 января — День работника прокуратуры Российской Федерации;
13 января — День российской печати;
14 января — День трубопроводных войск;
21 января — День инженерных войск;
25 января — День российского студенчества;
27 января — День полного освобождения Ленинграда от фашистской блокады (1944 год).";
        echo $b;
        break;
    case 2:
        echo "В феврале праздники -
1 февраля — Международный день десерта, День работника лифтового хозяйства.
2 февраля — День разгрома Красной армией немецко-фашистских войск в Сталинградской битве в 1943 году, День дефектоскописта в России, День сурка в США и Канаде, День ездовых собак, Всемирный день водно-болотных угодий.
3 февраля — Всемирный день борьбы с ненормативной лексикой, Международный день женщины-врача.
4 февраля — Всемирный день борьбы против рака, Международный день человеческого братства, День рождения Гусарова.
5 февраля — Всемирный день Нутеллы.
6 февраля — День бармена, День отказа от мобильного телефона, Международный день саамов.
7 февраля — День зимних видов спорта, День бизнес-образования.
8 февраля — День российской науки, День военного топографа.
9 февраля — Международный день стоматолога, Международный день пиццы, День работника гражданской авиации.
10 февраля — Всемирный день зернобобовых, День дипломатического работника.
11 февраля — Международный день женщин и девочек в науке, Международный день безопасного Интернета.
12 февраля — День Дарвина.
13 февраля — Всемирный день радио.
14 февраля — День всех влюблённых (День святого Валентина), Международный день дарения книг, День компьютерщика.
15 февраля — Всемирный день детей, больных раком, Международный день операционной медсестры.
16 февраля — День разведки Военно-морского флота России.
17 февраля — День спонтанного проявления доброты, День российских студенческих отрядов, День кадета.
18 февраля — День батарейки.
19 февраля — Всемирный день китов, День орнитолога.
20 февраля — Всемирный день социальной справедливости.
21 февраля — Международный день родного языка, Всемирный день экскурсовода.
23 февраля — День защитника Отечества.
24 февраля — Начало Масленичной недели.
26 февраля — Мой ДР.
27 февраля — Международный день белого медведя, Международный день оптимиста, Международный день неправительственных и некоммерческих организаций (НКО).";
        break;
    case 3:
        echo "В марте празники -
    1 марта — День экспертно-криминалистической службы системы МВД России, Всемирный день гражданской обороны, День кошек в России.
2 марта — Международный день детского телевидения и радиовещания.
3 марта — Всемирный день писателя, Всемирный день дикой природы, День театрального кассира.
4 марта — Всемирный день инженерии.
5 марта — День выключенных гаджетов.
8 марта — Международный женский день (официальный праздник).
9 марта — День работников геодезии и картографии (официальный праздник), Всемирный день диджея.
10 марта — День архивов в России, Международный день женщин-судей.
11 марта — День работника органов наркоконтроля (официальный праздник), День сотрудников частных охранных агентств в России.
12 марта — День работника уголовно-исполнительной системы (официальный праздник), Всемирный день против киберцензуры.
15 марта — Всемирный день прав потребителей.
16 марта — День работников торговли, бытового обслуживания населения и ЖКХ (официальный праздник), День подразделений экономической безопасности органов внутренних дел РФ.
18 марта — Всемирный день социальной работы.
19 марта — Международный день клиента, День моряка-подводника.
20 марта — Международный день счастья.
21 марта — Всемирный день поэзии, Международный день кукольника, Международный день лесов, Международный день борьбы за ликвидацию расовой дискриминации.
22 марта — Всемирный день водных ресурсов, Международный день таксиста.
23 марта — День работников гидрометеорологической службы (официальный праздник), Всемирный метеорологический день.
24 марта — День штурманской службы ВВС России.
25 марта — День работника культуры (официальный праздник).
27 марта — День войск национальной гвардии РФ (официальный праздник), Всемирный день театра.
29 марта — День специалиста юридической службы в Вооружённых Силах РФ (официальный праздник).";
        break;
    case 4:
        echo "В апреле праздники -
        2 апреля — День единения народов России и Беларуси.
4 апреля — День веб-мастера.
5 апреля — Международный день нравственности, День закупщика.
6 апреля — День геолога, День работников следственных органов МВД России, Международный день спорта на благо развития и мира.
7 апреля — День рождения Рунета, Всемирный день здоровья.
8 апреля — День сотрудников военных комиссариатов, День российской анимации.
12 апреля — День космонавтики.
13 апреля — День войск противовоздушной обороны, День мецената и благотворителя в России, Всемирный день рок-н-ролла.
14 апреля — День медицинской службы уголовно-исполнительной системы.
15 апреля — День специалиста по радиоэлектронной борьбе, Международный день культуры, День экологических знаний.
16 апреля — Всемирный день голоса.
17 апреля — День ветеранов органов внутренних дел и внутренних войск МВД России.
18 апреля — Всемирный день радиолюбителя.
19 апреля — День российской полиграфии, День работника ломоперерабатывающей отрасли России, Всемирный день цирка.
20 апреля — Национальный день донора в России.
21 апреля — День местного самоуправления, День главного бухгалтера в России, Всемирный день творчества и инновационной деятельности.
23 апреля — День работников пресс-служб уголовно-исполнительной системы, Всемирный день книги и авторского права.
25 апреля — Международный день делегата, День ДНК, Всемирный день борьбы с малярией.
26 апреля — День нотариата, День участников ликвидации последствий радиационных аварий и катастроф и памяти жертв этих аварий и катастроф, Международный день интеллектуальной собственности, День сметчика, Международный день ветеринарного врача.
27 апреля — День российского парламентаризма, День соединений и воинских частей по охране важных государственных объектов и специальных грузов Росгвардии, День вахтовика, Всемирный день породненных городов.
28 апреля — День работников скорой медицинской помощи, Всемирный день охраны труда, День борьбы за права человека от химической опасности.
29 апреля — Международный день танца.
30 апреля — День пожарной охраны, Международный день джаза, Международный день свечника. ";
        break;
    case 5:
        echo "В мае праздники - 
        1 мая — Праздник Весны и Труда (официальный праздник).
3 мая — День кондитера в России, Всемирный день свободы печати.
4 мая — Международный день пожарных.
5 мая — День водолаза, День шифровальщика, Международный день борьбы за права инвалидов, Международный день акушерки.
7 мая — День радио, праздник работников всех отраслей связи (официальный праздник), День создания Вооружённых Сил РФ, День связиста и специалиста радиотехнической службы ВМФ России.
8 мая — День работников Федеральной службы по военно-техническому сотрудничеству России, День оперативного работника уголовно-исполнительной системы России.
9 мая — День Победы (официальный праздник).
10 мая — Всемирный день справедливой торговли.
12 мая — День экологического образования, Международный день медицинской сестры.
14 мая — День фрилансера.
15 мая — Международный день отказника от военной службы по убеждениям совести, Международный день семей.
16 мая — День биографов.
18 мая — Международный день музеев.
19 мая — День фармацевтического работника (официальный праздник).
20 мая — Всемирный день метрологии, Всемирный день травматолога.
21 мая — День полярника (официальный праздник), День военного переводчика, День инвентаризатора.
22 мая — Всемирный день бассейновой индустрии.
24 мая — День кадровика.
25 мая — День химика (официальный праздник), День филолога.
26 мая — День российского предпринимательства (официальный праздник).
27 мая — Общероссийский День библиотек (официальный праздник).
28 мая — День пограничника (официальный праздник), День оптимизатора Рунета (День SEO-оптимизатора), День специалиста негабаритных грузоперевозок (День негабаритчика).
29 мая — День военного автомобилиста (официальный праздник), День ветеранов таможенной службы России.
30 мая — День сварщика.
31 мая — День российской адвокатуры (официальный праздник), День образования подразделений по делам несовершеннолетних в системе органов внутренних дел РФ.";
        break;
    case 6:
        $b="В июне праздники -
        1 июня — День Северного флота ВМФ России, День создания военно-транспортной авиации России, Международный день защиты детей, Всемирный день родителей, День мелиоратора в России.
4 июня — День крановщика (День машиниста крана), Всемирный день бега.
5 июня — День эколога (официальный праздник), День образования российской полиции, День создания Государственной службы карантина растений в России, Всемирный день окружающей среды.
6 июня — День русского языка (официальный праздник).
7 июня — Всемирный день безопасности пищевых продуктов.
8 июня — День социального работника (официальный праздник), День работников текстильной и лёгкой промышленности (официальный праздник).
9 июня — Международный день архивов, Международный день аккредитации.
10 июня — Всемирный день мотоциклиста.
12 июня — День России (официальный праздник), Всемирный день борьбы с детским трудом.
14 июня — День работника миграционной службы (официальный праздник), День работника воспитательной службы уголовно-исполнительной системы (официальный праздник), День пивовара, День мебельщика, Международный день блогера, Всемирный день донора крови, Всемирный день жонглирования.
15 июня — День медицинского работника (официальный праздник), Всемирный день распространения информации о злоупотреблениях в отношении пожилых людей.
16 июня — Международный день семейных денежных переводов.
18 июня — День службы военных сообщений (официальный праздник).
19 июня — Международный день борьбы с сексуальным насилием в условиях конфликта, Всемирный день детского футбола.
20 июня — День специалиста минно-торпедной службы ВМФ России.
21 июня — День кинологических подразделений МВД России (официальный праздник), День кинологической службы уголовно-исполнительной системы (официальный праздник), Международный день йоги, Международный день скейтбординга, Всемирный день гидрографии.
22 июня — День народных художественных промыслов (официальный праздник).
23 июня — Международный праздник музыкантов-народников, Международный Олимпийский день.
25 июня — День работника статистики (официальный праздник), День моряка.
26 июня — Международный день борьбы со злоупотреблением наркотическими средствами и их незаконным оборотом, Международный день в поддержку жертв пыток.
27 июня — День микро-, малых и средних предприятий, Всемирный день рыболовства.
28 июня — День судебного эксперта (официальный праздник), День изобретателя и рационализатора (официальный праздник), День молодёжи (официальный праздник), День российского букмекера.
29 июня — День кораблестроителя (официальный праздник).
30 июня — Международный день парламентаризма.";
        echo $b;
        break;
    case 7:
        echo "В июле праздинки -
        13 июля — День рыбака (выпадает на второе воскресенье июля).
14 июля — Летние кузьминки, старинный праздник, посвящённый святым Косме и Дамиану.
15 июля — День русской лени.
16 июля — День вкусной еды и день ангела у Александра, Василия, Анатолия, Константина, Ивана, Михаила.
17 июля — Всемирный день эмодзи.
18 июля — Международный день Нельсона Манделы и день прогулок под дождём.
19 июля — День Москвы-реки.
20 июля — Международный день шахмат.
21 июля — День обнимания своих детей.
22 июля — День летнего отдыха и гамака.
23 июля — День дачника.
24 июля — День флориста в России.
25 июля — День вина и сыра, а также дни карусели, малины, новых вкусов и запахов.
26 июля — День дяди и тети, а также всех, кто так или иначе связан с парашютным спортом.
27 июля — День Нептуна.
28 июля — День крещения Руси и загадывания желаний.
29 июля — Международный день тигра.
30 июля — Международный день дружбы.
31 июля — День вспоминания любимых книжек и день рождения Гарри Поттера.";
        break;
    case 8:
        echo "В августе праздники -
1 августа — День памяти российских воинов, погибших в Первой мировой войне 1914–1918 годов;
2 августа — День Воздушно-десантных войск;
3 августа (первое воскресенье августа) — День железнодорожника;
6 августа — День железнодорожных войск;
9 августа — День первой в российской истории морской победы русского флота под командованием Петра Первого над шведами у мыса Гангут, День окончания Ленинградской битвы (1944);
10 августа (второе воскресенье августа) — День строителя;
12 августа — День Военно-воздушных сил;
18 августа — День географа;
20 августа (третье воскресенье августа) — День Воздушного флота России;
22 августа — День Государственного флага Российской Федерации;
23 августа — День разгрома советскими войсками немецко-фашистских войск в Курской битве;
27 августа — День кино;
31 августа — День ветеринарного работника, День шахтёра (последнее воскресенье августа).";
        break;
    case 9:
        echo "В сентебре праздники - 4 сентября — День специалиста по ядерному обеспечению России.
7 сентября — День нефтяника, День озера Байкал.
8 сентября — Международный день грамотности, День новороссийской военно-морской базы ВМФ России.
9 сентября — Международный день красоты, День тестировщика, День дизайнера-графика.
10 сентября — Всемирный день предотвращения самоубийств.
11 сентября — Всероссийский день трезвости, День специалиста органов воспитательной работы Вооружённых Сил России.
12 сентября — День семейного общения, Международный день вязания крючком.=
15 сентября — Международный день демократии, День работников санитарно-эпидемиологической службы России, День единства народов Дагестана.
16 сентября — Международный день интервенционной кардиологии, Международный день науки, техники и инноваций в интересах Юга.
17 сентября — Всемирный день безопасности пациентов, День HR-менеджера.
18 сентября — Международный день равной оплаты труда, Всемирный день мониторинга воды.
19 сентября — День секретаря, День оружейника.
20 сентября — Всемирный день чистоты, День рекрутера, Всемирный день донора костного мозга.
21 сентября — Международный день мира, День работников леса, Рождество Пресвятой Владычицы нашей Богородицы и Приснодевы Марии.
22 сентября — Всемирный день без автомобиля, Всемирный день защиты слонов.
23 сентября — Международный день жестовых языков, Дата создания информационных подразделений органов внутренних дел России.
24 сентября — День Государственного герба и Государственного флага Республики Крым.
26 сентября — Европейский день языков, Всемирный день контрацепции, День Управления ракетно-артиллерийского вооружения ВМФ РФ, День встречи со старыми друзьями.
27 сентября — Всемирный день туризма, День воспитателя и всех дошкольных работников, День астрономии, Воздвижение Честного и Животворящего Креста Господня.
28 сентября — День машиностроителя, Международный день глухих, Всемирный день борьбы против бешенства, День работников атомной отрасли, День генерального директора в России.
29 сентября — Всемирный день сердца, День отоларинголога.
30 сентября — День переводчика, День интернета, День сил специального назначения Росгвардии.";
        break;
    case 10:
        echo "В октябре праздники -
        1 октября — День пожилых людей, День кофе, День музыки.
2 октября — День среднего профессионального образования, День метростроителя.
5 октября — День учителя, День работника электронной промышленности (первое воскресенье октября).
12 октября — День работника сельского хозяйства и перерабатывающей промышленности (второе воскресенье октября), День кадрового работника.
13 октября — День военного моряка-гидрографа.
17 октября — День участкового терапевта.
19 октября — День отца, День работников пищевой промышленности, День работников дорожного хозяйства, Всероссийский день лицеиста.
20 октября — День военного связиста.
22 октября — День финансово-экономической службы Вооружённых Сил РФ.
23 октября — День рекламиста.
24 октября — День подразделений специального назначения Вооружённых Сил РФ, День дипломатов, День ООН.
25 октября — День таможенника Российской Федерации, День маркетолога, День художника.
26 октября — День автомобилиста.
28 октября — День бабушек и дедушек, День создания армейской авиации России, День дзюдо.
29 октября — День вневедомственной охраны.
30 октября — День памяти жертв политических репрессий, День тренера, День инженера, День моряка-надводника.
31 октября — Хэллоуин, День Чёрного моря, День экономики.";
        break;
    case 11:
        echo "В ноябре праздники -
        1 ноября — Международный день вегана, День судебного пристава.
2 ноября — Всемирный день мужчин.
3 ноября — День хранения тайны.
4 ноября — День народного единства в России, празднование Казанской иконе Божией Матери.
5 ноября — День военного разведчика.
6 ноября — День работника службы делопроизводства и режима уголовно-исполнительной системы Российской Федерации, День осведомлённости о стрессе.
7 ноября — День согласия и примирения.
8 ноября — День пианиста, День рентгенолога, Всемирный день урбанизма.
9 ноября — Международный день против фашизма, расизма и антисемитизма, Международный день антиядерных акций, День специального отряда быстрого реагирования (СОБР) МВД России.
10 ноября — Всемирный день науки за мир и развитие, День сотрудника органов внутренних дел Российской Федерации, Всемирный день молодёжи, Международный день бухгалтерии.
11 ноября — Всемирный день шопинга, Международный день энергосбережения, День экономиста, День военного пенсионера.
12 ноября — Всемирный день борьбы с пневмонией, Синичкин день в России (в поддержку зимующих птиц), День специалиста по безопасности, День работников Сбербанка России.
13 ноября — Всемирный день доброты, День службы защиты государственной тайны Вооружённых сил России.";
        break;
    case 12:
        echo "В декабре праздники - 18 декабря — Международный день мигранта;
19 декабря — Международный день помощи бедным;
20 декабря — Международный день солидарности людей;
23 декабря — Международный день сноубординга;
25 декабря — Католическое Рождество;
28 декабря — День невинных младенцев, Международный день кино. ";
        break;
        default:
        echo "ничего не совпало";
}

?>


<H1>ЗАДАНИЕ 3</H1>

<?php
$n = 23;

function f($n) {
    $l = $n % 10;
    $s = 0;
    
    switch ($l) {
        case 0:
            $s = 0;
            break;
        case 1:
            $s = 1;
            break;
        case 2:
            $s = 4;
            break;
        case 3:
            $s = 9;
            break;
        case 4:
            $s = 6;
            break;
        case 5:
            $s = 5;
            break;
        case 6:
            $s = 6;
            break;
        case 7:
            $s = 9;
            break;
        case 8:
            $s = 4;
            break;
        case 9:
            $s = 1;
            break;
    }
    
    return $s;
}

$r = f($n);
echo "$r\n";
?>



<H1> ЗАДАНИЕ 4</H1>

<?php

$k = 23131332123;
$r = p($k);
function p($k) {
    $d = $k % 10;
    $t = $k % 100;
    $w = 'лет';
    
    switch (true) {
        case ($t >= 11 && $t <= 14):
            $w = 'лет';
            break;
        case ($d == 1):
            $w = 'год';
            break;
        case ($d >= 2 && $d <= 4):
            $w = 'года';
            break;

    }
    
    return "Мне $k $w";
}


echo "$r\n";
?>


<h1>ЗАДАНИЕ 5</h1>

<?php
$u = 4; 
$m = 21500;
function c($u, $m) {
    $r = 0;
    
    switch ($u) {
        case 1:
            $r = $m;
            break;
        case 2: 
            $r = $m / 1000000;
            break;
        case 3: 
            $r = $m / 1000;
            break;
        case 4: 
            $r = $m * 1000;
            break;
        case 5: 
            $r = $m * 100;
            break;
        default:
            $r = $m;
    }
    
    return $r;
}


$k = c($u, $m);
echo " $k кг\n";
?>